app/controllers/contas_controller.rb

SELECT * FROM `contas`
---
  def index
    @contas = Conta.all

SELECT * FROM `tipo_contas` WHERE (`tipo_contas`.`id` = 1)
---
  def show
    @conta = Conta.find(params[:id])

SELECT * FROM `contas` WHERE (`contas`.`id` = 2)
---
  def edit
    @tipo_contas = TipoConta.find(:all)

INSERT INTO `contas` (`tipo_conta_id`, `created_at`, `nome`, `updated_at`, `descricao`) VALUES(NULL, '2010-03-20 20:34:47', NULL, '2010-03-20 20:34:47', NULL)
---
  def create
    @conta = Conta.new(params[:conta])

    respond_to do |format|
      if @conta.save

SELECT * FROM `contas` WHERE (`contas`.`id` = 2)
UPDATE `contas` SET `updated_at` = '2010-03-21 23:59:58', `valor_inicial` = -4000.0 WHERE `id` = 2
---
  def update
    @conta = Conta.find(params[:id])

    respond_to do |format|
      if @conta.update_attributes(params[:conta])

SELECT * FROM `contas` WHERE (`contas`.`id` = 1)
DELETE FROM `contas` WHERE `id` = 1
---
  def destroy
    @conta = Conta.find(params[:id])
    @conta.destroy