app/controllers/lancamentos_controller.rb

SELECT * FROM `lancamentos`
---
  def index
    @lancamentos = Lancamento.all

SELECT * FROM `lancamentos` WHERE (`lancamentos`.`id` = 1)
---
  def show
    @lancamento = Lancamento.find(params[:id])

INSERT INTO `lancamentos` (`conta_id`, `data`, `created_at`, `credito_debito`, `updated_at`, `valor`, `descricao`, `tipo_lancamento_id`) VALUES(2, '2010-03-21', '2010-03-21 06:26:13', 'c', '2010-03-21 06:26:13', 3000.0, 'salario', 3)
---
  def create
    @lancamento = Lancamento.new(params[:lancamento])

    respond_to do |format|
      if @lancamento.save