app/controllers/saldo_controller.rb

  def atual
    #Lancamento.find_by_conta_id_and_data_and_credito_debito(
    #:conta_id => params[:id], :data => Date.new, :credito_debito => "c")
    hoje = DateTime.now
    credito = Lancamento.sum :valor, :conditions => {:conta_id => params[:id], :data => Date.new(hoje.year, hoje.month, hoje.day), :credito_debito => 'c'}
    debito  = Lancamento.sum :valor, :conditions => {:conta_id => params[:id], :data => Date.new(hoje.year, hoje.month, hoje.day), :credito_debito => 'd'}

    @saldo = credito - debito
    @conta = Conta.find_by_id(params[:id])
---
SELECT sum(`lancamentos`.valor) AS sum_valor FROM `lancamentos` WHERE (`lancamentos`.`conta_id` = '2' AND `lancamentos`.`credito_debito` = 'c' AND `lancamentos`.`data` = '-4712-01-01')
SELECT * FROM `contas` WHERE (`contas`.`id` = '2') LIMIT 1