app/controllers/tipo_lancamentos_controller.rb

  def index
    @tipo_lancamentos = TipoLancamento.all
---
SELECT * FROM `tipo_lancamentos`

  def show
    @tipo_lancamento = TipoLancamento.find(params[:id])
---
SELECT * FROM `tipo_lancamentos` WHERE (`tipo_lancamentos`.`id` = 1)

  def create
    @tipo_lancamento = TipoLancamento.new(params[:tipo_lancamento])

    respond_to do |format|
      if @tipo_lancamento.save
---
INSERT INTO `tipo_lancamentos` (`created_at`, `updated_at`, `nome`, `descricao`) VALUES('2010-03-21 05:52:59', '2010-03-21 05:52:59', 'Supermercado', 'comprar no supermecado')