app/controllers/tipo_contas_controller.rb

SELECT * FROM `tipo_contas`
---
  def index
    @tipo_contas = TipoConta.all

SELECT * FROM `tipo_contas` WHERE (`tipo_contas`.`id` = 1)
---
  def show
    @tipo_conta = TipoConta.find(params[:id])

INSERT INTO `tipo_contas` (`created_at`, `nome`, `updated_at`, `descricao`) VALUES('2010-03-20 20:59:16', 'Conta Corrente', '2010-03-20 20:59:16', 'conta corrente bancaria')
---
  def create
    @tipo_conta = TipoConta.new(params[:tipo_conta])

    respond_to do |format|
      if @tipo_conta.save